backend/SK-client/src/test/jmeter/stage1_product_query.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Stage1 - Product Query Baseline" enabled="true">
      <stringProp name="TestPlan.comments">Stage1: Basic Microservice Architecture Performance Baseline</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <stringProp name="TestPlan.name">Stage1 - Product Query Baseline</stringProp>
    </TestPlan>
    <hashTree/>
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Product Query Thread Group" enabled="true">
      <stringProp name="ThreadGroup.comments">100 concurrent users, ramp-up 10s, duration 60s</stringProp>
      <elementProp name="ThreadGroup.main_controller" testclass="LoopController" guiclass="LoopControlPanel" testname="Loop Controller">
        <boolProp name="LoopController.continue_forever">false</boolProp>
        <stringProp name="LoopController.loops">-1</stringProp>
      </elementProp>
      <stringProp name="ThreadGroup.num_threads">100</stringProp>
      <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      <stringProp name="ThreadGroup.ramp_time">10</stringProp>
      <boolProp name="ThreadGroup.scheduler">true</boolProp>
      <stringProp name="ThreadGroup.duration">60</stringProp>
      <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      <stringProp name="ThreadGroup.name">Product Query Thread Group</stringProp>
    </ThreadGroup>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product Query Request" enabled="true">
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">8079</stringProp>
        <stringProp name="HTTPSampler.path">/gateway/test/ping</stringProp>
        <stringProp name="HTTPSampler.method">GET</stringProp>
        <stringProp name="HTTPSampler.follow_redirects">true</stringProp>
        <stringProp name="HTTPSampler.auto_redirects">false</stringProp>
        <stringProp name="HTTPSampler.use_keepalive">true</stringProp>
        <stringProp name="HTTPSampler.DO_MULTIPART_POST">false</stringProp>
        <stringProp name="HTTPSampler.IPSourceType">0</stringProp>
        <stringProp name="HTTPSampler.name">Product Query Request</stringProp>
      </HTTPSamplerProxy>
      <hashTree/>
      <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true">
        <stringProp name="ConstantTimer.delay">100</stringProp>
        <stringProp name="ConstantTimer.name">Think Time</stringProp>
      </ConstantTimer>
      <hashTree/>
    </hashTree>
    <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
    </ResultCollector>
    <hashTree/>
    <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
    </ResultCollector>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>